import React from "react";
import KakaoMap from "../components/KakaoMap";
import "../styles/components/MapDirections.css";
import { Link } from 'react-router-dom';

const MapDirections = () => {
    return (
        <div className="map-page-container">
            <div className="content-area">
                {/* 제목 및 공유 아이콘 */}
                <div className="map-header">
                    <h1>오시는 길</h1>
                    <div>
                        <span>🔗</span> {/* 공유 아이콘 자리 */}
                    </div>
                </div>

                {/* 지도 영역 */}
                <div className="map-container">
                    <KakaoMap />
                </div>

                {/* 순환버스 안내 섹션 */}
                <div className="bus-info">
                    <span className="bus-icon"><svg width="60px" height="60px" viewBox="0 0 24 24" xmlns="http://www.w3.org/2000/svg"><path d="M8.5,17a1,1,0,0,0,1-1,1.36,1.36,0,0,0,0-.2.64.64,0,0,0-.06-.18.76.76,0,0,0-.09-.18l-.12-.15a1,1,0,0,0-.33-.21A1,1,0,0,0,8.3,15l-.18.06-.18.09a1.58,1.58,0,0,0-.15.12l-.12.15a.76.76,0,0,0-.09.18.64.64,0,0,0-.06.18,1.36,1.36,0,0,0,0,.2,1,1,0,0,0,1,1Zm8,0a1,1,0,0,0,1-1,1.36,1.36,0,0,0,0-.2.64.64,0,0,0-.06-.18.76.76,0,0,0-.09-.18l-.12-.15a1.15,1.15,0,0,0-.33-.21,1,1,0,0,0-.76,0,1.15,1.15,0,0,0-.33.21l-.12.15a.76.76,0,0,0-.09.18.64.64,0,0,0-.06.18,1.36,1.36,0,0,0,0,.2,1,1,0,0,0,.29.7A1,1,0,0,0,16.5,17Zm-3-12h-2a1,1,0,0,0,0,2h2a1,1,0,0,0,0-2Zm5-3H6.5a3,3,0,0,0-3,3V17a3,3,0,0,0,2,2.82V21a1,1,0,0,0,2,0V20h10v1a1,1,0,0,0,2,0V19.82a3,3,0,0,0,2-2.82V5A3,3,0,0,0,18.5,2Zm1,15a1,1,0,0,1-1,1H6.5a1,1,0,0,1-1-1V14h14Zm0-5H5.5V5a1,1,0,0,1,1-1h12a1,1,0,0,1,1,1Z" fill="#6563ff" /></svg></span>
                    <div>
                        <h2>순환버스 이용</h2>
                        <p>
                            <strong>부산대양산캠퍼스역<svg width="20" height="20" viewBox="0 0 64 64" xmlns="http://www.w3.org/2000/svg"><g data-name="Layer 19" id="Layer_19"><path d="M60.33,24.6,43.65,9.88a.51.51,0,0,0-.71,0l-2.23,2.52a.52.52,0,0,0-.12.36.51.51,0,0,0,.17.35l9,8H8.45a.5.5,0,0,0-.5.5V25a.5.5,0,0,0,.5.5H60a.5.5,0,0,0,.33-.88Z" fill="#6563ff" /><path d="M55.55,38.52H4a.5.5,0,0,0-.33.88L20.35,54.12a.5.5,0,0,0,.33.12h0a.51.51,0,0,0,.34-.17l2.23-2.52a.52.52,0,0,0,.12-.36.51.51,0,0,0-.17-.35l-9-8H55.55a.5.5,0,0,0,.5-.5V39A.5.5,0,0,0,55.55,38.52Z" fill="#6563ff" /></g></svg>본관</strong>
                        </p>
                        <p>
                            양산부산대학교병원에서는 환자분들의 편의를 위해 순환버스를 운영하고 있습니다.<br />
                            방문객 및 내원객 이용이 불가하며, 이용 시 진료예약 또는 예약문자를 확인한 후 탑승이 가능합니다.<br />
                            (부산대양산캠퍼스역 3번 출입구)
                        </p>
                        {/* 임시표시 */}
                        <Link to="/hospital/bus" className="bus-button">
                            순환버스 이용시간 보기
                        </Link>
                    </div>
                </div>


                <div className="bus-info">
                    <span className="bus-icon"> <svg width="60px" height="60px" viewBox="0 0 24 24" xmlns="http://www.w3.org/2000/svg"><path d="M6.62,13.08a.9.9,0,0,0-.54.54,1,1,0,0,0,1.3,1.3,1.15,1.15,0,0,0,.33-.21,1.15,1.15,0,0,0,.21-.33A.84.84,0,0,0,8,14a1.05,1.05,0,0,0-.29-.71A1,1,0,0,0,6.62,13.08Zm13.14-4L18.4,5.05a3,3,0,0,0-2.84-2H8.44A3,3,0,0,0,5.6,5.05L4.24,9.11A3,3,0,0,0,2,12v4a3,3,0,0,0,2,2.82V20a1,1,0,0,0,2,0V19H18v1a1,1,0,0,0,2,0V18.82A3,3,0,0,0,22,16V12A3,3,0,0,0,19.76,9.11ZM7.49,5.68A1,1,0,0,1,8.44,5h7.12a1,1,0,0,1,1,.68L17.61,9H6.39ZM20,16a1,1,0,0,1-1,1H5a1,1,0,0,1-1-1V12a1,1,0,0,1,1-1H19a1,1,0,0,1,1,1Zm-3.38-2.92a.9.9,0,0,0-.54.54,1,1,0,0,0,1.3,1.3.9.9,0,0,0,.54-.54A.84.84,0,0,0,18,14a1.05,1.05,0,0,0-.29-.71A1,1,0,0,0,16.62,13.08ZM13,13H11a1,1,0,0,0,0,2h2a1,1,0,0,0,0-2Z" fill="#6563ff" /></svg></span>
                    <div>
                        <h2>자동차 이용</h2><br />
                        <p>
                            <strong>남양산IC에서 오시는 길 </strong><br />
                            남양산IC 통과후 우회전 <svg width="24" height="24" data-name="Layer 1" viewBox="0 0 24 24" xmlns="http://www.w3.org/2000/svg"><path d="M17.92,11.62a1,1,0,0,0-.21-.33l-5-5a1,1,0,0,0-1.42,1.42L14.59,11H7a1,1,0,0,0,0,2h7.59l-3.3,3.29a1,1,0,0,0,0,1.42,1,1,0,0,0,1.42,0l5-5a1,1,0,0,0,.21-.33A1,1,0,0,0,17.92,11.62Z" fill="#6563ff" /></svg>석산지하차도 우측<svg width="24" height="24" data-name="Layer 1" viewBox="0 0 24 24" xmlns="http://www.w3.org/2000/svg"><path d="M17.92,11.62a1,1,0,0,0-.21-.33l-5-5a1,1,0,0,0-1.42,1.42L14.59,11H7a1,1,0,0,0,0,2h7.59l-3.3,3.29a1,1,0,0,0,0,1.42,1,1,0,0,0,1.42,0l5-5a1,1,0,0,0,.21-.33A1,1,0,0,0,17.92,11.62Z" fill="#6563ff" /></svg>금오대교 직진<svg width="24" height="24" data-name="Layer 1" viewBox="0 0 24 24" xmlns="http://www.w3.org/2000/svg"><path d="M17.92,11.62a1,1,0,0,0-.21-.33l-5-5a1,1,0,0,0-1.42,1.42L14.59,11H7a1,1,0,0,0,0,2h7.59l-3.3,3.29a1,1,0,0,0,0,1.42,1,1,0,0,0,1.42,0l5-5a1,1,0,0,0,.21-.33A1,1,0,0,0,17.92,11.62Z" fill="#6563ff" /></svg>양산부산대학교병원
                        </p>
                        <br />
                        <p>
                            <strong>물금IC에서 오시는길</strong><br />
                            물금IC 통과후 좌회전<svg width="24" height="24" data-name="Layer 1" viewBox="0 0 24 24" xmlns="http://www.w3.org/2000/svg"><path d="M17.92,11.62a1,1,0,0,0-.21-.33l-5-5a1,1,0,0,0-1.42,1.42L14.59,11H7a1,1,0,0,0,0,2h7.59l-3.3,3.29a1,1,0,0,0,0,1.42,1,1,0,0,0,1.42,0l5-5a1,1,0,0,0,.21-.33A1,1,0,0,0,17.92,11.62Z" fill="#6563ff" /></svg>두번째 신호등 좌회전<svg width="24" height="24" data-name="Layer 1" viewBox="0 0 24 24" xmlns="http://www.w3.org/2000/svg"><path d="M17.92,11.62a1,1,0,0,0-.21-.33l-5-5a1,1,0,0,0-1.42,1.42L14.59,11H7a1,1,0,0,0,0,2h7.59l-3.3,3.29a1,1,0,0,0,0,1.42,1,1,0,0,0,1.42,0l5-5a1,1,0,0,0,.21-.33A1,1,0,0,0,17.92,11.62Z" fill="#6563ff" /></svg>금오대교 직진<svg width="24" height="24" data-name="Layer 1" viewBox="0 0 24 24" xmlns="http://www.w3.org/2000/svg"><path d="M17.92,11.62a1,1,0,0,0-.21-.33l-5-5a1,1,0,0,0-1.42,1.42L14.59,11H7a1,1,0,0,0,0,2h7.59l-3.3,3.29a1,1,0,0,0,0,1.42,1,1,0,0,0,1.42,0l5-5a1,1,0,0,0,.21-.33A1,1,0,0,0,17.92,11.62Z" fill="#6563ff" /></svg>양산부산대학교병원
                        </p>
                    </div>
                </div>

                <div className="bus-info">
                    <span className="bus-icon"><svg width="60px" height="60px" viewBox="0 0 24 24" xmlns="http://www.w3.org/2000/svg"><path d="M16,17a1,1,0,0,0,1-1,1.36,1.36,0,0,0,0-.2.64.64,0,0,0-.06-.18.76.76,0,0,0-.09-.18l-.12-.15a1.15,1.15,0,0,0-.33-.21,1,1,0,0,0-.76,0,1.15,1.15,0,0,0-.33.21l-.12.15a.76.76,0,0,0-.09.18.64.64,0,0,0-.06.18,1.36,1.36,0,0,0,0,.2,1,1,0,0,0,1,1ZM18,2H6A3,3,0,0,0,3,5V17a3,3,0,0,0,1.2,2.39l-.91.9a1,1,0,0,0,0,1.42,1,1,0,0,0,1.42,0L6.41,20H17.59l1.7,1.71a1,1,0,0,0,1.42,0,1,1,0,0,0,0-1.42l-.91-.9A3,3,0,0,0,21,17V5A3,3,0,0,0,18,2ZM5,8h6v4H5Zm14,9a1,1,0,0,1-1,1H6a1,1,0,0,1-1-1V14H19Zm0-5H13V8h6Zm0-6H5V5A1,1,0,0,1,6,4H18a1,1,0,0,1,1,1ZM8,17a1,1,0,0,0,1-1,1.36,1.36,0,0,0,0-.2.64.64,0,0,0-.06-.18.76.76,0,0,0-.09-.18l-.12-.15a1.15,1.15,0,0,0-.33-.21,1,1,0,0,0-.76,0,1.15,1.15,0,0,0-.33.21l-.12.15a.76.76,0,0,0-.09.18A.64.64,0,0,0,7,15.8,1.36,1.36,0,0,0,7,16a1,1,0,0,0,.29.7A1,1,0,0,0,8,17Z" fill="#6563ff" /></svg></span>
                    <div>
                        <h2>지하철 이용</h2><br />
                        <p>
                            <strong>1호선 이용시</strong><br />
                            1호선 이용시 부산대역, 온천장역, 명륜역 하차 <svg width="24" height="24" data-name="Layer 1" viewBox="0 0 24 24" xmlns="http://www.w3.org/2000/svg"><path d="M17.92,11.62a1,1,0,0,0-.21-.33l-5-5a1,1,0,0,0-1.42,1.42L14.59,11H7a1,1,0,0,0,0,2h7.59l-3.3,3.29a1,1,0,0,0,0,1.42,1,1,0,0,0,1.42,0l5-5a1,1,0,0,0,.21-.33A1,1,0,0,0,17.92,11.62Z" fill="#6563ff" /></svg>1300번 버스 환승<svg width="24" height="24" data-name="Layer 1" viewBox="0 0 24 24" xmlns="http://www.w3.org/2000/svg"><path d="M17.92,11.62a1,1,0,0,0-.21-.33l-5-5a1,1,0,0,0-1.42,1.42L14.59,11H7a1,1,0,0,0,0,2h7.59l-3.3,3.29a1,1,0,0,0,0,1.42,1,1,0,0,0,1.42,0l5-5a1,1,0,0,0,.21-.33A1,1,0,0,0,17.92,11.62Z" fill="#6563ff" /></svg>범어주공 3차아파트 정류소 하차<svg width="24" height="24" data-name="Layer 1" viewBox="0 0 24 24" xmlns="http://www.w3.org/2000/svg"><path d="M17.92,11.62a1,1,0,0,0-.21-.33l-5-5a1,1,0,0,0-1.42,1.42L14.59,11H7a1,1,0,0,0,0,2h7.59l-3.3,3.29a1,1,0,0,0,0,1.42,1,1,0,0,0,1.42,0l5-5a1,1,0,0,0,.21-.33A1,1,0,0,0,17.92,11.62Z" fill="#6563ff" /></svg>양산부산대학교병원(도보 이동)<br />
                        </p><br />
                        <strong>2호선 이용시</strong><br />
                        2호선 이용시 부산대양산캠퍼스역 하차 <svg width="24" height="24" data-name="Layer 1" viewBox="0 0 24 24" xmlns="http://www.w3.org/2000/svg"><path d="M17.92,11.62a1,1,0,0,0-.21-.33l-5-5a1,1,0,0,0-1.42,1.42L14.59,11H7a1,1,0,0,0,0,2h7.59l-3.3,3.29a1,1,0,0,0,0,1.42,1,1,0,0,0,1.42,0l5-5a1,1,0,0,0,.21-.33A1,1,0,0,0,17.92,11.62Z" fill="#6563ff" /></svg>순환버스 이용 <svg width="24" height="24" data-name="Layer 1" viewBox="0 0 24 24" xmlns="http://www.w3.org/2000/svg"><path d="M17.92,11.62a1,1,0,0,0-.21-.33l-5-5a1,1,0,0,0-1.42,1.42L14.59,11H7a1,1,0,0,0,0,2h7.59l-3.3,3.29a1,1,0,0,0,0,1.42,1,1,0,0,0,1.42,0l5-5a1,1,0,0,0,.21-.33A1,1,0,0,0,17.92,11.62Z" fill="#6563ff" /></svg>양산부산대학교병원
                        <br />
                    </div>
                </div>

                <div className="bus-info">
                    <span className="bus-icon">
                        <svg viewBox="0 0 24 24" xmlns="http://www.w3.org/2000/svg"><path d="M18.5,2H6.5a3,3,0,0,0-3,3V17a3,3,0,0,0,2,2.82V21a1,1,0,0,0,2,0V20h10v1a1,1,0,0,0,2,0V19.82a3,3,0,0,0,2-2.82V5A3,3,0,0,0,18.5,2ZM5.5,8h6v4h-6Zm14,9a1,1,0,0,1-1,1H6.5a1,1,0,0,1-1-1V14h14Zm0-5h-6V8h6Zm0-6H5.5V5a1,1,0,0,1,1-1h12a1,1,0,0,1,1,1ZM16.12,16.92a1,1,0,0,0,.38.08,1,1,0,0,0,1-1,1.36,1.36,0,0,0,0-.2.64.64,0,0,0-.06-.18.76.76,0,0,0-.09-.18,1.58,1.58,0,0,0-.12-.15l-.15-.12a.76.76,0,0,0-.18-.09A.64.64,0,0,0,16.7,15a1,1,0,0,0-.91.27,1.58,1.58,0,0,0-.12.15.76.76,0,0,0-.09.18.64.64,0,0,0-.06.18,1.36,1.36,0,0,0,0,.2,1,1,0,0,0,.29.7A1,1,0,0,0,16.12,16.92Zm-8,0A1,1,0,0,0,8.5,17a1,1,0,0,0,1-1,1.36,1.36,0,0,0,0-.2.64.64,0,0,0-.06-.18.76.76,0,0,0-.09-.18,1.58,1.58,0,0,0-.12-.15l-.15-.12-.18-.09L8.7,15a1,1,0,0,0-.91.27,1.58,1.58,0,0,0-.12.15.76.76,0,0,0-.09.18.64.64,0,0,0-.06.18,1.36,1.36,0,0,0,0,.2,1,1,0,0,0,.29.7A1,1,0,0,0,8.12,16.92Z" fill="#6563ff" /></svg>
                    </span>
                    <div className="bus-content">
                        <h2>버스 이용</h2><br />
                        <p><strong>양산시내</strong></p>
                        <p><strong>* 양산부산대학교병원 정문 하차 :</strong> 10번(증산↔내석), 16번(증산↔부산대후문), 17번(증산↔노포동), 26번(양산역환승센터↔물금역), 38번(증산↔금산), 52번(양산부산대병원↔용당), 132번(증산↔범어사)</p>
                        <p><strong>* 범어주공3차아파트 정류소 하차 :</strong> 10번(증산↔내석), 21번(북정↔덕천), 23(심야2)번(구,터미널↔증산역), 26번(양산역환승센터↔물금역), 132번(증산↔범어사), 138번(북정↔원동), 1300번(증산↔명륜역)</p>
                        <br />
                        <p>
                            <strong>양산시외버스터미널<svg width="24" height="24" data-name="Layer 1" viewBox="0 0 24 24" xmlns="http://www.w3.org/2000/svg"><path d="M17.92,11.62a1,1,0,0,0-.21-.33l-5-5a1,1,0,0,0-1.42,1.42L14.59,11H7a1,1,0,0,0,0,2h7.59l-3.3,3.29a1,1,0,0,0,0,1.42,1,1,0,0,0,1.42,0l5-5a1,1,0,0,0,.21-.33A1,1,0,0,0,17.92,11.62Z" fill="#6563ff" /></svg>양산부산대학교병원</strong><br />
                            10번, 16번, 17번, 52번 버스 이용하여 양산부산대학교병원 정문 앞 하차<br />
                            23(심야2)번, 138번, 1300번 버스 이용하여 범어주공3차아파트 정류소 하차
                        </p>
                        <p>
                            <strong>부산<svg width="20" height="20" viewBox="0 0 64 64" xmlns="http://www.w3.org/2000/svg"><g data-name="Layer 19" id="Layer_19"><path d="M60.33,24.6,43.65,9.88a.51.51,0,0,0-.71,0l-2.23,2.52a.52.52,0,0,0-.12.36.51.51,0,0,0,.17.35l9,8H8.45a.5.5,0,0,0-.5.5V25a.5.5,0,0,0,.5.5H60a.5.5,0,0,0,.33-.88Z" fill="#6563ff" /><path d="M55.55,38.52H4a.5.5,0,0,0-.33.88L20.35,54.12a.5.5,0,0,0,.33.12h0a.51.51,0,0,0,.34-.17l2.23-2.52a.52.52,0,0,0,.12-.36.51.51,0,0,0-.17-.35l-9-8H55.55a.5.5,0,0,0,.5-.5V39A.5.5,0,0,0,55.55,38.52Z" fill="#6563ff" /></g></svg>양산부산대학교병원</strong><br />
                            16번(증산↔부산대후문), 17번(증산↔노포동), 21번(북정↔덕천), 132번(증산↔범어사), 1300번(증산↔명륜역)
                        </p>
                        <p>
                            <a href="https://bus.yangsan.go.kr/yangsan_2016/main/main.php" className="bus-button">
                                양산시 버스정보시스템 바로가기
                            </a>
                        </p>
                    </div>
                </div>

                <div className="bus-info">
                    <span className="bus-icon"><svg aria-labelledby="trainIconTitle" color="#2329D6" fill="none" height="70px" stroke="#2329D6" stroke-linecap="square" stroke-linejoin="miter" stroke-width="1" viewBox="0 0 24 24" width="70px" xmlns="http://www.w3.org/2000/svg"><title id="trainIconTitle" /><path d="M6 11V6M6 11V16C6 16.5523 6.44772 17 7 17H8M6 11H12M6 6C6.66667 5.33333 8 4 12 4C16 4 17.3333 5.33333 18 6M6 6H12M18 6V11M18 6H12M18 11V16C18 16.5523 17.5523 17 17 17H16M18 11H12M8 17H16M8 17L7 20H17L16 17M12 11V6" /><circle cx="9" cy="14" r="1" /><circle cx="15" cy="14" r="1" /></svg></span>
                    <div>
                        <h2>기차 이용</h2><br />
                        <strong>물금역</strong><br />
                        <p>물금역 버스정류소<svg width="24" height="24" data-name="Layer 1" viewBox="0 0 24 24" xmlns="http://www.w3.org/2000/svg"><path d="M17.92,11.62a1,1,0,0,0-.21-.33l-5-5a1,1,0,0,0-1.42,1.42L14.59,11H7a1,1,0,0,0,0,2h7.59l-3.3,3.29a1,1,0,0,0,0,1.42,1,1,0,0,0,1.42,0l5-5a1,1,0,0,0,.21-.33A1,1,0,0,0,17.92,11.62Z" fill="#6563ff" /></svg>  21번 버스이용 <svg width="24" height="24" data-name="Layer 1" viewBox="0 0 24 24" xmlns="http://www.w3.org/2000/svg"><path d="M17.92,11.62a1,1,0,0,0-.21-.33l-5-5a1,1,0,0,0-1.42,1.42L14.59,11H7a1,1,0,0,0,0,2h7.59l-3.3,3.29a1,1,0,0,0,0,1.42,1,1,0,0,0,1.42,0l5-5a1,1,0,0,0,.21-.33A1,1,0,0,0,17.92,11.62Z" fill="#6563ff" /></svg> 범어주공3차 정류소에서 하차 <svg width="24" height="24" data-name="Layer 1" viewBox="0 0 24 24" xmlns="http://www.w3.org/2000/svg"><path d="M17.92,11.62a1,1,0,0,0-.21-.33l-5-5a1,1,0,0,0-1.42,1.42L14.59,11H7a1,1,0,0,0,0,2h7.59l-3.3,3.29a1,1,0,0,0,0,1.42,1,1,0,0,0,1.42,0l5-5a1,1,0,0,0,.21-.33A1,1,0,0,0,17.92,11.62Z" fill="#6563ff" /></svg>양산부산대학교병원(도보이동)</p><br />
                        <strong>울산역</strong><br />
                        <p> 울산역 <svg width="24" height="24" data-name="Layer 1" viewBox="0 0 24 24" xmlns="http://www.w3.org/2000/svg"><path d="M17.92,11.62a1,1,0,0,0-.21-.33l-5-5a1,1,0,0,0-1.42,1.42L14.59,11H7a1,1,0,0,0,0,2h7.59l-3.3,3.29a1,1,0,0,0,0,1.42,1,1,0,0,0,1.42,0l5-5a1,1,0,0,0,.21-.33A1,1,0,0,0,17.92,11.62Z" fill="#6563ff" /></svg> 3000번 버스이용 <svg width="24" height="24" data-name="Layer 1" viewBox="0 0 24 24" xmlns="http://www.w3.org/2000/svg"><path d="M17.92,11.62a1,1,0,0,0-.21-.33l-5-5a1,1,0,0,0-1.42,1.42L14.59,11H7a1,1,0,0,0,0,2h7.59l-3.3,3.29a1,1,0,0,0,0,1.42,1,1,0,0,0,1.42,0l5-5a1,1,0,0,0,.21-.33A1,1,0,0,0,17.92,11.62Z" fill="#6563ff" /></svg> 양산역환승센터3정류소에서 16번, 17번, 52번, 138번 버스 환승<svg width="24" height="24" data-name="Layer 1" viewBox="0 0 24 24" xmlns="http://www.w3.org/2000/svg"><path d="M17.92,11.62a1,1,0,0,0-.21-.33l-5-5a1,1,0,0,0-1.42,1.42L14.59,11H7a1,1,0,0,0,0,2h7.59l-3.3,3.29a1,1,0,0,0,0,1.42,1,1,0,0,0,1.42,0l5-5a1,1,0,0,0,.21-.33A1,1,0,0,0,17.92,11.62Z" fill="#6563ff" /></svg>  양산부산대학교병원 </p><br />
                        <strong>구포역</strong> <br /><p>구포역 덕천역에서 2호선 환승 <svg width="24" height="24" data-name="Layer 1" viewBox="0 0 24 24" xmlns="http://www.w3.org/2000/svg"><path d="M17.92,11.62a1,1,0,0,0-.21-.33l-5-5a1,1,0,0,0-1.42,1.42L14.59,11H7a1,1,0,0,0,0,2h7.59l-3.3,3.29a1,1,0,0,0,0,1.42,1,1,0,0,0,1.42,0l5-5a1,1,0,0,0,.21-.33A1,1,0,0,0,17.92,11.62Z" fill="#6563ff" /></svg>부산대양산캠퍼스역 하차후 순환버스이용 <svg width="24" height="24" data-name="Layer 1" viewBox="0 0 24 24" xmlns="http://www.w3.org/2000/svg"><path d="M17.92,11.62a1,1,0,0,0-.21-.33l-5-5a1,1,0,0,0-1.42,1.42L14.59,11H7a1,1,0,0,0,0,2h7.59l-3.3,3.29a1,1,0,0,0,0,1.42,1,1,0,0,0,1.42,0l5-5a1,1,0,0,0,.21-.33A1,1,0,0,0,17.92,11.62Z" fill="#6563ff" /></svg>  양산부산대학교병원 </p>
                    </div>
                </div>

            </div>
        </div>
    );
};

export default MapDirections;
